#include"Resection.h"

//座標データ
double mat[4][5] = { {-0.08615,-0.06899,36589.41,25273.32,2195.17},
{-0.05340,0.08221,37631.08,31324.51,728.69},
{-0.01478,-0.07663,39100.97,24934.98,2386.50},
{0.01046,0.06443,40426.54,30319.81,757.31} };

int main() {
	double* myMat = new double[20];
	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 5; j++) {
			myMat[5 * i + j] = mat[i][j];
		}
	}
	Resection MatCalcu(myMat, 4, 5, 0.0, 0.0, 0.15324,10000);
	cout<<"外方位元素：\n"<<MatCalcu.結果()<<endl<<"最终旋转矩阵：\n"<<MatCalcu.回転マトリックスが得られます();
}